In [1]:
pip install --upgrade mysql-connector-python

Requirement already satisfied: mysql-connector-python in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (9.2.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector
from mysql.connector import errorcode

In [3]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='tienda')

print(cnx)
cnx.close()

<mysql.connector.connection_cext.CMySQLConnection object at 0x105ca0440>

In [4]:
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost',
                              database='tienda')
# en caso de que no lo consigas por que hay algún error entonces ...
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)
else:
  cnx.close()

In [5]:
config = {
  'user': 'root',
  'password': 'AlumnaAdalab',
  'host': '127.0.0.1',
  'database': 'tienda',
  'raise_on_warnings': True
}

cnx = mysql.connector.connect(**config)

cnx.close()

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [8]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE DATABASE alumnas_promo_X")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)


cnx.close()

1007 (HY000): Can't create database 'alumnas_promo_X'; database exists
Error Code: 1007
SQLSTATE HY000
Message Can't create database 'alumnas_promo_X'; database exists

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [10]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost', database='alumnas_promo_X')


mycursor = cnx.cursor()
try:
    mycursor.execute("CREATE TABLE alumnas (id_alumna INT, nombre VARCHAR(50), apellidos VARCHAR(100), ciudad VARCHAR(50), teléfono VARCHAR(50))")
    print(mycursor)
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

CMySQLCursor: CREATE TABLE alumnas (id_alumna INT, nom..

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [ ]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost', database='alumnas_promo_X')


mycursor = cnx.cursor()
query = "INSERT INTO alumnas (id_alumna, nombre, apellidos, ciudad, teléfono) VALUES (%s, %s, %s, %s, %s)"
val = [
    ("001", "Ana", "López", "Barcelona", "+345672889393"), 
    ("002", "Leidy", "Bejarano", "Barcelona", "+348894758475"),
    ("003", "Carlos", "Ramírez", "Madrid", "+346781234567"),
    ("004", "Lucía", "Gómez", "Valencia", "+349876543210"),
    ("005", "Martín", "Fernández", "Sevilla", "+346654321987"),
    ("006", "Elena", "Martínez", "Bilbao", "+348812345678"),
    ("007", "Javier", "Sánchez", "Zaragoza", "+349912348765"),
    ("008", "Paula", "Navarro", "Málaga", "+345523498764"),
    ("009", "David", "Ortega", "Granada", "+346798765432"),
    ("010", "Sara", "Ruiz", "Alicante", "+349887654321")
]
try: 
    mycursor.executemany(query, val)
    cnx.commit()
    print(mycursor.rowcount, "registro insertado.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

2 registro insertado.

In [17]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='localhost', database='alumnas_promo_X')


mycursor = cnx.cursor()
sql = "DELETE FROM alumnas WHERE nombre = 'Leidy'"
try:
    mycursor.execute(sql)
    cnx.commit()
    print(mycursor.rowcount, "registro/s eliminado/s")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

2 registro/s eliminado/s

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [23]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# realizamos la query
mycursor.execute("SELECT * FROM alumnas")

# le pedimos que almacene todos los resultados
myresult = mycursor.fetchall()

# accedemos a cada fila de una en una usando un bucle for. Fijaos que nos devuelve tuplas!!!
for x in myresult:
  print(x)

(3, 'Carlos', 'Ramírez', 'Madrid', '+346781234567')
(4, 'Lucía', 'Gómez', 'Valencia', '+349876543210')
(5, 'Martín', 'Fernández', 'Sevilla', '+346654321987')
(6, 'Elena', 'Martínez', 'Bilbao', '+348812345678')
(7, 'Javier', 'Sánchez', 'Zaragoza', '+349912348765')
(8, 'Paula', 'Navarro', 'Málaga', '+345523498764')
(9, 'David', 'Ortega', 'Granada', '+346798765432')
(10, 'Sara', 'Ruiz', 'Alicante', '+349887654321')
(1, 'Ana', 'López', 'Barcelona', '+345672889393')
(2, 'Leidy', 'Bejarano', 'Barcelona', '+348894758475')

In [20]:
import pandas as pd

In [24]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM alumnas")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ["id_alumna", "nombre", "apellidos", "ciudad", "teléfono"])

#Cerramos la conexion
cnx.close()

In [26]:
df.head(10)

   id_alumna  nombre  apellidos     ciudad       teléfono
0          3  Carlos    Ramírez     Madrid  +346781234567
1          4   Lucía      Gómez   Valencia  +349876543210
2          5  Martín  Fernández    Sevilla  +346654321987
3          6   Elena   Martínez     Bilbao  +348812345678
4          7  Javier    Sánchez   Zaragoza  +349912348765
5          8   Paula    Navarro     Málaga  +345523498764
6          9   David     Ortega    Granada  +346798765432
7         10    Sara       Ruiz   Alicante  +349887654321
8          1     Ana      López  Barcelona  +345672889393
9          2   Leidy   Bejarano  Barcelona  +348894758475

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [ ]:
pd.concat([df.head(3), df.tail(3)])

   id_alumna  nombre  apellidos     ciudad       teléfono
0          3  Carlos    Ramírez     Madrid  +346781234567
1          4   Lucía      Gómez   Valencia  +349876543210
2          5  Martín  Fernández    Sevilla  +346654321987
7         10    Sara       Ruiz   Alicante  +349887654321
8          1     Ana      López  Barcelona  +345672889393
9          2   Leidy   Bejarano  Barcelona  +348894758475

7. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [33]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT ciudad FROM alumnas")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ["ciudad"])

#Cerramos la conexion
cnx.close()

In [36]:
df.head(10)

      ciudad
0     Madrid
1   Valencia
2    Sevilla
3     Bilbao
4   Zaragoza
5     Málaga
6    Granada
7   Alicante
8  Barcelona
9  Barcelona

8. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

In [37]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM alumnas WHERE ciudad = 'Barcelona'")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ["id_alumna", "nombre", "apellidos", "ciudad", "teléfono"])

#Cerramos la conexion
cnx.close()

In [40]:
df.head()

   id_alumna nombre apellidos     ciudad       teléfono
0          1    Ana     López  Barcelona  +345672889393
1          2  Leidy  Bejarano  Barcelona  +348894758475

In [41]:
# conectamos con el servidor
cnx = mysql.connector.connect(
  host="localhost",
  user="root",
  password="AlumnaAdalab",
  database="alumnas_promo_X"
)

# iniciamos el cursor
mycursor = cnx.cursor()

# ejecutamos nuestra query
mycursor.execute("SELECT * FROM alumnas WHERE ciudad = 'Bilbao'")

# le decimos que nos devuelva todos los resultados y los almacenamos en una variable llamada myresult
myresult = mycursor.fetchall()

#Creamos un dataframe con los resultados de la consulta SQL almacenados en myresult. Si os fijáis le estamos pasando un parámetro llamado "columns" donde estamos especificando cuáles son las columnas de lo que será nuestro dataframe
df = pd.DataFrame(myresult, columns = ["id_alumna", "nombre", "apellidos", "ciudad", "teléfono"])

#Cerramos la conexion
cnx.close()

In [42]:
df.head()

   id_alumna nombre apellidos  ciudad       teléfono
0          6  Elena  Martínez  Bilbao  +348812345678